[
    {
    "Name": "Men's T-Shirt",
    "Brand": "Fashion Zone",
    "Price": "$29.99",
    "Description": "This stylish men's t-shirt is made with high-quality materials for comfort and durability. It features a classic design and a comfortable fit, making it perfect for everyday wear.",
    "Category": "Clothing",
    "Rating": 4.5,
    "Image": "https://larrywongkahei.github.io/img/men-t-shirt-1.jpeg"
  },
  {
    "Name": "Trendy Urban Tee",
    "Brand": "Urban Style",
    "Price": "$39.99",
    "Description": "Stay ahead of the fashion game with this trendy urban tee. Made from premium materials, it offers both comfort and style. The sleek design and perfect fit make it a must-have for any fashion-forward individual.",
    "Category": "Clothing",
    "Rating": 4.8,
    "Image": "https://larrywongkahei.github.io/img/men-t-shirt-2.jpeg"
  },
  {
    "Name": "Classic Striped Men's Tee",
    "Brand": "RetroStyle",
    "Price": "$34.99",
    "Description": "Elevate your casual look with this classic striped men's tee. Crafted with attention to detail, it offers both comfort and timeless style. The versatile design and soft fabric make it a wardrobe staple for any fashion-savvy individual.",
    "Category": "Clothing",
    "Rating": 4.6,
    "Image": "https://larrywongkahei.github.io/img/men-t-shirt-3.jpeg"
  },
  {
    "Name": "Graphic Print T-Shirt",
    "Brand": "Expressive Wear",
    "Price": "$19.99",
    "Description": "Make a statement with this eye-catching graphic print t-shirt. Designed with creativity in mind, it adds a touch of personality to your outfit. The soft fabric and comfortable fit ensure all-day comfort.",
    "Category": "Clothing",
    "Rating": 4.2,
    "Image": "https://larrywongkahei.github.io/img/men-t-shirt-4.jpeg"
  },
  {
    "Name": "Sporty Performance Tee",
    "Brand": "ActivePro",
    "Price": "$44.99",
    "Description": "Stay cool and comfortable during workouts with this sporty performance tee. Engineered with moisture-wicking technology, it keeps you dry and focused. The athletic design and stretchy fabric provide optimal mobility.",
    "Category": "Clothing",
    "Rating": 4.9,
    "Image": "https://larrywongkahei.github.io/img/men-t-shirt-5.jpeg"
  },
  {
    "Name": "Women's T-Shirt",
    "Brand": "Fashionista",
    "Price": "$29.99",
    "Description": "This trendy women's t-shirt is made with high-quality materials for comfort and style. It features a flattering fit and a versatile design, making it a perfect addition to your wardrobe.",
    "Category": "Clothing",
    "Rating": 4.5,
    "Image": "https://larrywongkahei.github.io/img/women-t-shirt-1.jpeg"
  },
  {
    "Name": "Chic Striped Tee",
    "Brand": "Elegance Couture",
    "Price": "$39.99",
    "Description": "Stay chic and comfortable with this striped women's tee. Made from premium fabrics, it offers both style and comfort. The timeless design and classic stripes make it a versatile choice for any occasion.",
    "Category": "Clothing",
    "Rating": 4.8,
    "Image": "https://larrywongkahei.github.io/img/women-t-shirt-2.jpeg"
  },
  {
    "Name": "Casual V-Neck T-Shirt",
    "Brand": "Relaxation Station",
    "Price": "$34.99",
    "Description": "Experience comfort and style with this casual v-neck t-shirt. Crafted with soft materials, it offers a relaxed fit and easygoing vibe. The versatile design and variety of colors make it a wardrobe essential.",
    "Category": "Clothing",
    "Rating": 4.6,
    "Image": "https://larrywongkahei.github.io/img/women-t-shirt-3.jpeg"
  },
  {
    "Name": "Printed Floral Top",
    "Brand": "Blooming Blossoms",
    "Price": "$19.99",
    "Description": "Add a touch of femininity with this printed floral top. The delicate floral pattern and lightweight fabric create a graceful look. Pair it with your favorite jeans or skirt for a charming ensemble.",
    "Category": "Clothing",
    "Rating": 4.2,
    "Image": "https://larrywongkahei.github.io/img/women-t-shirt-4.jpeg"
  },
  {
    "Name": "Athletic Performance Tee",
    "Brand": "ActiveFit",
    "Price": "$44.99",
    "Description": "Stay active and stylish with this athletic performance tee. Engineered with moisture-wicking technology, it keeps you cool and dry during your workouts. The sporty design and comfortable fit make it an ideal choice for your active lifestyle.",
    "Category": "Clothing",
    "Rating": 4.9,
    "Image": "https://larrywongkahei.github.io/img/women-t-shirt-5.jpeg"
  },
  {
    "Name": "Nike Go FlyEase",
    "Brand": "Nike",
    "Price": "$149.99",
    "Description": "Experience the future of footwear with Nike Go FlyEase. These innovative shoes feature a hands-free design with a unique tension band system that allows for easy on and off. They provide comfort, flexibility, and style for your everyday activities.",
    "Category": "Shoes",
    "Rating": 4.7,
    "Image": "https://larrywongkahei.github.io/img/Nike-Go-FlyEase-1.jpeg"
  },
  {
    "Name": "Adidas Run Falcon 2.0",
    "Brand": "Adidas",
    "Price": "$89.99",
    "Description": "Get ready for your run with Adidas Run Falcon 2.0. These running shoes offer excellent comfort, support, and style. With a lightweight construction and responsive cushioning, they are designed to enhance your performance and keep you comfortable mile after mile.",
    "Category": "Shoes",
    "Rating": 4.5,
    "Image": "https://larrywongkahei.github.io/img/Adidas-Run-Falcon-2.0-2.jpeg"
  },
  {
    "Name": "Women's Casual Shoes",
    "Brand": "Fashionista",
    "Price": "$59.99",
    "Description": "Step out in style with these fashionable women's casual shoes. Designed for both comfort and style, they feature a trendy design and a comfortable fit. These versatile shoes are perfect for any casual occasion.",
    "Category": "Shoes",
    "Rating": 4.6,
    "Image": "https://larrywongkahei.github.io/img/Women-shoes-3.jpeg"
  },
  {
    "Name": "International Dance Shoes",
    "Brand": "DanceFusion",
    "Price": "$129.99",
    "Description": "Take your dance performance to the next level with these international dance shoes. Designed for both comfort and elegance, they provide the necessary support and flexibility for your dance moves. Step onto the dance floor with confidence.",
    "Category": "Shoes",
    "Rating": 4.8,
    "Image": "https://larrywongkahei.github.io/img/International-dance-shoes-4.jpeg"
  },
  {
    "Name": "Pointed Creeper Red",
    "Brand": "Alternative Style",
    "Price": "$79.99",
    "Description": "Make a bold fashion statement with these pointed creeper shoes in red. The unique design and vibrant color add an edgy touch to your outfit. These shoes are perfect for those who dare to stand out.",
    "Category": "Shoes",
    "Rating": 4.3,
    "Image": "https://larrywongkahei.github.io/img/Pointed-creeper-red-5.jpeg"
  }
]